benchmark/results/run_20260123_145550/small_file.txt
Running 30s test @ http://127.0.0.1:8080/static/index.html
  4 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.44ms    7.66ms  54.41ms   33.68%
    Req/Sec     3.01k   178.20     3.40k    78.92%
  Latency Distribution
     50%    8.94ms
     75%   16.00ms
     90%   16.92ms
     99%   19.29ms
  360055 requests in 30.01s, 75.37MB read
Requests/sec:  11998.97
Transfer/sec:      2.51MB